test/liquid_solid_fluidized_bed_semi/force_buoyancy+drag/Yang/CFD/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}

gradSchemes
{
  default         Gauss linear;
  grad(p)         Gauss linear;
  grad(U)         Gauss linear;
}

divSchemes
{
  default         Gauss linear;
  div(phi,U)      Gauss limitedLinearV 1;
  div(phi,k)      Gauss limitedLinear 1;
  div(phi,epsilon) Gauss limitedLinear 1;
  div(phi,R)      Gauss limitedLinear 1;
  div(R)          Gauss linear;
  div(phi,nuTilda) Gauss limitedLinear 1;
  div((nuEff*dev(grad(U).T()))) Gauss linear;
  div((nuEff*dev(T(grad(U))))) Gauss linear;
  div((viscousTerm*dev(grad(U).T()))) Gauss linear;
  div((nu*dev(grad(U).T()))) Gauss linear;
}

laplacianSchemes
{
  default         Gauss linear corrected;
  laplacian(viscousTerm,U) Gauss linear corrected;
  laplacian(nu,U) Gauss linear corrected;
  laplacian(nuEff,U) Gauss linear corrected;
  laplacian((1|A(U)),p) Gauss linear corrected;
  laplacian((voidFraction2|A(U)),p) Gauss linear corrected;
  laplacian(DkEff,k) Gauss linear corrected;
  laplacian(DepsilonEff,epsilon) Gauss linear corrected;
  laplacian(DREff,R) Gauss linear corrected;
  laplacian(DnuTildaEff,nuTilda) Gauss linear corrected;
}

interpolationSchemes
{
  default         linear;
}

snGradSchemes
{
  default         corrected;
}

fluxRequired
{
  default         no;
  p               ;
}
